Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON LATAM_+99 Reinforced Wooden Stick.tmx
Source language: en
Languages: es_419

source: the higher the reinforcement level, the higher chance of the next reinforcement failing.
es_419: Cuanto más alto sea el nivel de mejora, más probabilidades hay de que falle en el siguiente nivel.

source: that old guy with the dark lips never gives up.
es_419: Ese viejo de labios oscuros nunca se rinde.

source: lean
es_419: SE INCLINA

source: hey, mister! what’s going on here?!
es_419: Oiga, señor, ¡¿qué está pasando?!

source: fighter
es_419: LUCHADORA

source: wait.
es_419: Espera.

source: I’m revealing it all today!
es_419: ¡Hoy sacaré todo a la luz!

source: ...it wasn’t just me who had evolved with the changing times.
es_419: … no era solo yo quien había evolucionado con los años.

source: which douchebag thought of this ridiculous concep--
es_419: ¿A qué imbécil se le ocurrió este concepto ridíc…?

source: my character got deleted because it got killed by an npc monster? what the hell?
es_419: ¿Se borró mi personaje porque lo mató un monstruo que es PNJ? ¿Qué rayos?

source: what was that all about?
es_419: ¿Por qué hiciste eso?

source: eat up.
es_419: Come.

source: I want us to be a happy family again.
es_419: quisiera que fuéramos una familia feliz otra vez.

source: chrono life is done for.
es_419: Chrono Life está acabado.

source: cough
es_419: COF

source: slash
es_419: ZAAAS

source: I need to continue pretending to be a newbie, right?
es_419: Debo seguir fingiendo que soy un novato, ¿no?

source: ...possibly even more?
es_419: … ¿quizá más?

source: f-finally, things are a bit more calm.
es_419: P-por fin se calmó todo un poco.

source: why the hell not?!
es_419: ¡¿Y por qué diablos no?!

source: virtual reality capsule room
es_419: SALA DE CÁPSULAS DE REALIDAD VIRTUAL

source: they only had one daughter.
es_419: Tenían solo una hija.

source: most powerful mage of the royal family & leader of the holy land guild, abracadabra
es_419: Abracadabra, la maga más poderosa de la familia real y líder del Gremio Tierra Santa

source: f*ck!
es_419: ¡M*erda!

source: anyway, take a seat. we don’t have time.
es_419: En fin, siéntate. No hay tiempo.

source: smack
es_419: PAF

source: I’ll show all of you!
es_419: ¡Les mostraré!

source: those poor old men!
es_419: ¡Esos pobres viejos!

source: it was a sheer massacre.
es_419: Literalmente fue una masacre.

source: starting today, my life as a poor kid is over.
es_419: A partir de hoy, se acaba mi vida de pobre.

source: oh...
es_419: Ah…

source: wriggle
es_419: FRIUM

source: if you don’t want to die, that is.
es_419: Si no quieres morir, claro.

source: please run and save yourself, boss!
es_419: Por favor, ¡huya y sálvese, jefe!

source: she’s the number one idol of the music industry.
es_419: Es la cantante número uno de la industria musical.

source: what’s the matter?
es_419: ¿Qué pasa?

source: Hello, all chrono life users. this is the chrono life staff.
es_419: Hola a todos los usuarios. Somos los desarrolladores de Chrono Life.

source: seriously? he still hasn’t taken care of that?
es_419: ¿En serio? ¿Aún no terminó con ese asunto?

source: are you going to log out too?
es_419: ¿También se va a desconectar?

source: what?
es_419: ¿Qué?

source: who on eart--
es_419: ¿Quién rayos…?

source: could...
es_419: ¿Será…?

source: ...the battle that happened that day became a hot topic.
es_419: … la batalla de ese día se convirtió en un tema candente.

source: mass murder madman
es_419: Loco homicida

source: StoryㆍHongsil,
es_419: Historia: Hongsil

source: there’s no way anyone besides him can see me.
es_419: Nadie más que él puede verme.

source: "heh"?
es_419: ¿”Je”?

source: goooooo!{j}db
es_419: ¡Vamoooos!

source: ha
es_419: JA

source: captain luv!
es_419: ¡Capitana Amor!

source: ...those two people didn’t deserve to be considered sarang’s parents.
es_419: … esas dos personas ya no merecían ser consideradas sus padres.

source: you're "captain luv", aren't you?
es_419: Eres la “capitana Amor”, ¿no?

source: the reward is...
es_419: El premio es…

source: I told you you’d be dead meat if you were late again!
es_419: ¡Te dije que te mataría si llegabas tarde otra vez!

source: chrono life pro-gamer feker sang-yeok lee
es_419: Jugador Pro de Chrono Life Feker Sang-Yeok Lee

source: well, duh!
es_419: Pff, ¡obvio!

source: gasp
es_419: AAAH

source: yawn!
es_419: Uaahh…

source: and I see myself practicing for a long time to come.
es_419: Y me veo practicando mucho tiempo más.

source: w-wait, what? their characters got deleted?!
es_419: ¡¿Q-qué?! ¡¿Les borraron los personajes?!

source: oh.
es_419: Ah.

source: ...you’re going to need at least three million members.
es_419: … van a necesitar al menos tres millones de miembros.

source: dig
es_419: Ñic

source: but there’s something strange about this.
es_419: Pero hay algo extraño.

source: I knew I shouldn’t have trusted her after seeing her crap items. pfft!
es_419: No debí confiar en ella después de ver su equipamiento de m*erda. ¡Pfff!

source: ...only the strong survive.
es_419: … solo sobreviven los fuertes.

source: that includes this girl too.
es_419: Eso incluye a esta chica.

source: I was wondering what you were going on about.
es_419: Me preguntaba de qué iba todo esto.

source: sparkle
es_419: BRILLA

source: hop
es_419: SALTA

source: ...all of the cells that were absorbed by urakan went back to their original owners.
es_419: … todas las células que había absorbido Urakan regresaron a sus dueños originales.

source: supreme commander of the world guild alliance
es_419: Comandante supremo de la alianza mundial de gremios

source: ha{j}ha{j}ha{j}ha{j}ha{j}ha{j}ha{j}ha{j}ha{j}ha{j}ha{j}ha{j}ha{j}ha{j}ha{j}ha
es_419: Ja ja ja ja ja ja ja ja ja

source: screw this game.
es_419: Maldito juego.

source: undies. lmao.
es_419: Calzón. Qué risa.

source: 92{j}hawkeye sucks!
es_419: ¡Hawkeye apesta!

source: why, you...
es_419: Pero ¿qué…?

source: oh, my.
es_419: Ay, cielos.

source: make it quick.
es_419: Acaba rápido.

source: you must have wanted to kill me so badly.
es_419: Debías tener muchas ansias de matarme.

source: b-boss!
es_419: ¡J-jefe!

source: ...all of the responsibility and blame for their disbandment fell onto him, leaving his reputation to fall down the drain.
es_419: … toda la responsabilidad y la culpa de esa disolución recayó sobre sus hombros, lo que dejó su reputación por el suelo.

source: what kind of utter crap is that?!
es_419: ¡¿Qué clase de basura es esa?!

source: wipe that damn smile off your face.
es_419: Borra esa maldita sonrisa de tu cara.

source: d-dad...
es_419: P-papá…

source: would you like...
es_419: ¿Te gustaría…

source: it’s been so long, noob.
es_419: Ha pasado mucho tiempo, novato.

source: did she just call me a noob?
es_419: ¿Me llamó novato?

source: wh-who are you?!
es_419: ¡¿Q-quién eres?!

source: so even if there were another user who reached master level...
es_419: Así que aunque hubiera otro usuario que alcanzara el nivel maestro…

source: is this what it’s like being a celebrity?
es_419: ¿Así se siente ser famoso?

source: Created by:
es_419: Creado por:

source: it’s for the vibe, don’t you know?
es_419: Es por la sensación, ¿no te das cuenta?

source: knuckles of silence 10,700,000 gold
es_419: Manoplas del Silencio 10 700 000 en oro

source: oops.
es_419: Ups.

source: q-quick! of course!
es_419: ¡Rápido! ¡Por supuesto!

source: secret tactic strike without killing
es_419: TÉCNICA SECRETA GOLPEAR SIN MATAR

source: you’ve gotten much stronger.
es_419: Te has vuelto muy fuerte.

source: in the end...
es_419: Y al final…

source: whoa.{j}su
es_419: Guau.

source: I’m deokbae choi, the ceo of chrono life.
es_419: Soy Deokbae Choi, el CEO de Chrono Life.

source: we couldn’t find you with just our powers alone.
es_419: No podíamos encontrarte solo por nuestros medios.

source: whirr
es_419: TRRRR

source: this can’t be!
es_419: ¡No puede ser!

source: after spending all of her time in her dark room...
es_419: Al pasar todo el tiempo en esa habitación oscura…

source: a monster that deletes characters???
es_419: ¿¿¿Un monstruo que borra personajes???

source: I’m going to take full advantage of this freedom!
es_419: ¡Voy a aprovechar al máximo esta libertad!

source: the soul of the [staff] has entered your body.
es_419: El alma de [la vara] ha entrado en tu cuerpo.

source: that’s a bit childish of me, isn’t it?
es_419: Soy un poco infantil, ¿no?

source: currently, there’s no way to stop him.
es_419: Por el momento, no hay forma de detenerlo.

source: how dare she?!
es_419: ¡¿Cómo se atreve?!

source: episode 16. character deleted (4)
es_419: Episodio 16: Personaje eliminado (4)

source: she’s mad because you lied to her and hid your powers.
es_419: Está enojada porque le mintió y ocultó sus poderes.

source: this is the story of a girl who loved to sing.
es_419: Esta es la historia de una chica que amaba cantar.

source: o-over there!
es_419: ¡P-por allí!

source: wh-where are we?
es_419: ¿D-Dónde estamos?

source: and that livestream hit a peak of 234,852 viewers.
es_419: Y ese stream tuvo un pico de 234 852 espectadores.

source: congratulations, sarang!
es_419: ¡Felicitaciones, Sarang!

source: was it?
es_419: dices que era?

source: sigh
es_419: Uff…

source: since when was this a horror game?!
es_419: ¡¿Desde cuándo este es un juego de horror?!

source: th-the whole continent...
es_419: To-todo el continente…

source: but...
es_419: Pero…

source: wait, where is my other head?
es_419: Ey, ¿dónde está mi otra cabeza?

source: pm
es_419: 7:30 P. M.

source: currently playing: chrono life
es_419: Jugando a: Chrono Life

source: so sick of that temper of yours!
es_419: ¡Estoy harta de tu temperamento!

source: what the f*ck?
es_419: ¡¿Qué c*rajo?!

source: ...all I could do was laugh.
es_419: … no pude más que reírme.

source: this is just the beginning.
es_419: Esto es solo el principio.

source: dash{j}a{j}a{j}a{j}a{j}a{j}a{j}a{j}a{j}a{j}a{j}a{j}!
es_419: FUSH

source: ...make sure to continue monitoring those characters like I mentioned.
es_419: … asegúrate de continuar vigilando a esos personajes que te dije.

source: I hate to go, but it’s all right, I suppose.
es_419: Lamento tener que irme, pero está bien, supongo.

source: flinch
es_419: SORPRENDIDO

source: you have absorbed the target’s levels.
es_419: Has absorbido el nivel de tu enemigo.

source: ...that I had forgotten about during this whirlwind we call life.
es_419: … que había olvidado durante este remolino al que llamamos vida.

source: it’s...
es_419: Es…

source: the only way I could see you was on tv.
es_419: Solo podía verte por la televisión.

source: isn’t that so cool?
es_419: ¿No es genial?

source: perfect. all done cleaning up.
es_419: Perfecto. Terminé de limpiar.

source: what do you mean?
es_419: ¿Qué dices?

source: a-and you do a good job...
es_419: Y-y también sabes muy bien…

source: w-well, it’s not his level that’s the issue.
es_419: B-bueno, el problema no es el nivel.

source: and even among people who didn’t even play games.
es_419: Incluso entre personas que ni siquiera juegan.

source: who the hell is this?
es_419: ¿Quién rayos es este?

source: k{j}a{j}p{j}o{j}w{j}!
es_419: ¡PUPUM!

source: who is she?
es_419: ¿Quién es ella?

source: yes...
es_419: Sí…

source: kneel
es_419: SE ARRODILLA

source: I’m going to log out for a bit!
es_419: ¡Me voy a desconectar un rato!

source: I need to pretend to be weak!
es_419: ¡Debo fingir que soy débil!

source: there were just too many strange things going on at once.
es_419: Eran demasiadas cosas extrañas al mismo tiempo.

source: whisper
es_419: SUSURRA

source: you’re...
es_419: ¿Tú eres…

source: aren’t you just an ai character in this game? is it okay for you to be talking about stuff like real money?
es_419: ¿No eres un personaje de IA del juego? ¿Es normal que hables de cosas como dinero real?

source: in chrono life, all equipment has a "weight" stat.
es_419: En Chrono Life, todo el equipamiento tiene “peso”.

source: are you kidding me right now?
es_419: ¿Acaso es una broma?

source: let me unprivate my stats so you can see them.
es_419: Haré público mi perfil para que puedas ver.

source: a witness to countless players...
es_419: Fue testigo de cómo innumerables jugadores…

source: here, you can have it.
es_419: Toma, puedes comértelo.

source: then could you boost* me?!
es_419: ¡¿Podrías subirme el nivel*?!

source: pay to win.
es_419: Pagar para ganar.

source: yeah, it’s me!
es_419: ¡Sí, soy yo!

source: ...with the underwear...
es_419: ¿El que anda en ropa interior…

source: you’re the one who made me do it!
es_419: ¡Tú fuiste la que me obligó a hacerlo!

source: Producerㆍdu-eop
es_419: Producción: Du-eop

source: drip
es_419: PLIC

source: that skill isn’t normally that strong.
es_419: Por lo general, no es una habilidad tan poderosa.

source: no way.
es_419: Imposible.

source: we will provide an update regarding the re-opening of the servers as soon as we can.
es_419: Los mantendremos informados con respecto a la reapertura de los servidores tan pronto como podamos.

source: th{j}wait, where’s he going?
es_419: Esperen, ¿adónde va?

source: y-you want me to hit them?
es_419: ¿Q-quieres que les pegue?

source: so that's where your inspiration for "mermaid's tale" came from.
es_419: Así que de ahí vino la inspiración para “El cuento de la sirena”.

source: the{j}livestream{j}will begin soon.
es_419: El stream en vivo empezará pronto.

source: tell me.
es_419: Dime.

source: your equips suck.
es_419: Tu equipamiento apesta.

source: well, I may not know how it all happened.
es_419: Bueno, quizá no sepa bien qué pasó,

source: we love you.
es_419: Te amamos.

source: did that happen when I first dropped that wooden stick?
es_419: ¿Eso pasó cuando se me cayó el palo la otra vez?

source: she left so suddenly.
es_419: Se fue repentinamente.

source: take a look at what he’s doing.
es_419: Mire lo que está haciendo.

source: no wonder you failed.
es_419: Con razón fallaste.

source: and those two people were...
es_419: Y esas dos personas eran…

source: I was going to go beat up those guys who rejected me.
es_419: Iba a ir a golpear a todos los que me rechazaron.

source: you two must be close.
es_419: Deben estar muy unidos…

source: I still need more.
es_419: Aún necesito más.

source: episode. how I went from convenience store clerk to millionaire -end-
es_419: Episodio 12: Cómo pasé de empleado de tienda a millonario -FIN-

source: but I ended up making a +99 reinforced wooden stick.
es_419: Pero terminé creando un palo de madera +99.

source: it would really help if you boosted me!
es_419: ¡Me ayudaría mucho que me subas el nivel!

source: hey, urus! come on out!
es_419: ¡Oye, Urus! ¡Sal de ahí!

source: episode 11. how I went from convenience store clerk to millionaire (1)
es_419: Episodio 11: Cómo pasé de empleado de tienda a millonario (1)

source: it’s the ultimate healing skill that fully recovers you from any and all damage you take.
es_419: Es la habilidad de curación máxima que hace que te recuperes completamente de todo el daño que recibas.

source: how did she have 100 million won laying around to spend on this game?
es_419: ¿Cómo es que tenía cien millones de wones para gastar en el juego?

source: sniffle
es_419: SNIF

source: are you seriously fawning over a wanted criminal here?!
es_419: ¡¿En serio están adulando a un criminal buscado?!

source: basically, I’m the spirit of this weapon.
es_419: Básicamente, soy el espíritu de esta arma.

source: 2{j}hi
es_419: Hola

source: your reputation has fallen.
es_419: Has perdido reputación.

source: come back when you’ve got +11 on all of your equips.
es_419: Regresa cuando todo tu equipamiento sea +11.

source: hey!
es_419: ¡Oye!

source: haven’t you ever seen those another world-genre comics?
es_419: ¿Nunca leíste esos cómics de fantasía?

source: you piece of scum.
es_419: … pedazo de basura.

source: my goodness, you poor noob.
es_419: Cielos, pobre novato.

source: you little *%&#&#*#@! all because of you, we’re %%&*#...
es_419: ¡Pequeño *%&#&#*#@! ¡Por tu culpa, estamos %%&*#...!

source: what’s wrong with him?
es_419: ¿Qué rayos le pasa?

source: urus’ soul has rejected the enemy.
es_419: El alma de Urus ha rechazado al enemigo.

source: call ended.
es_419: Llamada finalizada.

source: I’m neither!
es_419: ¡Nada de eso!

source: oh, right. that thing you were talking about last time...
es_419: Cierto, eso que decía la vez pasada…

source: that’s equal to ten billion won in real life cash...
es_419: Eso equivale a diez mil millones de wones en dinero verdadero…

source: so that’s the familiar energy I was feeling.
es_419: Esa era la energía familiar que estuve sintiendo.

source: crash
es_419: CRAS

source: ...is mine.
es_419: … es mío.

source: as well as all 3 million members of the world guild alliance.
es_419: Y también a los tres millones de miembros de la alianza mundial de gremios.

source: what’s wrong with you, sarang?!
es_419: ¡¿Qué te pasa, Sarang?!

source: how much did you spend?
es_419: ¿Cuánto gastaste?

source: three strikes left.
es_419: tres golpes.

source: ugh, how annoying!
es_419: ¡Agh, qué molesto!

source: wobble
es_419: SE TAMBALEA

source: yes, captain!
es_419: ¡Sí, capitana!

source: bloop
es_419: BLUUP

source: ...mother?{j}...mother?
es_419: … madre?

source: what an interesting way to go about things.{j}what an interesting way to go about things.
es_419: Qué manera tan interesante de proceder.

source: I thought you wanted to finish by 7:30 to get home and play games.
es_419: Pero pensé que querrías terminar a las 19:30 para regresar a casa y jugar un poco.

source: you look pretty happy for watching your own son die.
es_419: Pareces muy feliz a pesar de haber visto morir a tu hijo…

source: oh, right.
es_419: Ah, cierto.

source: that death was just the price to pay for knowledge.
es_419: Esa muerte fue el precio que tuve que pagar para obtener sabiduría.

source: there’s no way that’s it.
es_419: Es imposible que sea eso.

source: ...I’ve only got...
es_419: … solo me quedan…

source: what do you mean by that?
es_419: ¿Qué quieres decir?

source: I was just a common part-time convenience store clerk.
es_419: Yo era un simple empleado a tiempo parcial en una tienda.

source: but I’ve got a different idea.
es_419: Pero yo tengo otra idea.

source: but this is the place where urus, chrono life’s strongest boss monster resides.
es_419: … pero este es el lugar donde reside Urus, el monstruo más poderoso de Chrono Life.

source: undies!
es_419: ¡Calzón!

source: I’m never joining a party ever again!
es_419: ¡Jamás volveré a unirme a un grupo!

source: sway
es_419: FUUS

source: now he’s bound to stay a noob.
es_419: Ahora está condenado a seguir siendo un novato.

source: he has not shown himself in recent days for some reason.
es_419: No ha aparecido estos últimos días por alguna razón…

source: and j-just so you know, the ego sword is the highest-ranking weapon in chrono life.
es_419: Y para que sepa, la Espada Ego es el arma de mayor rango en Chrono Life.

source: you really are amazing, sir!
es_419: ¡Usted es increíble, señor!

source: hey! hey!
es_419: ¡Ey, ey!

source: pat
es_419: TAS

source: ...noob.
es_419: … novato.

source: she’s got pretty good items.
es_419: Su equipamiento es bastante bueno.

source: reach
es_419: FRAS

source: oh, my! that was spectacular!
es_419: ¡Cielos! ¡Eso fue espectacular!

source: it would take him approximately 2 to 3 seconds to pick up that money.
es_419: Le llevaría de dos a tres segundos levantar ese billete.

source: whatever, I don’t really care who or what you are.
es_419: Como sea, realmente no me importa quién o qué seas.

source: let’s leave this loser!
es_419: ¡Dejemos sola a esta perdedora!

source: back then, the games weren’t as flashy as they are now.
es_419: En ese entonces, los juegos no eran tan vistosos como son ahora.

source: smirk
es_419: SONRÍE

source: if you want that beating that badly.
es_419: Si tanto quieres esa paliza…

source: ooh!
es_419: ¡Aah!

source: screech
es_419: CRIIII

source: th-that’s just the script I have to follow.
es_419: E-eso está en el guion que debo seguir.

source: full potential?
es_419: ¿Todo mi poder?

source: what is it?
es_419: ¿Qué hace?

source: "suicide"?
es_419: ¿”Suicidio”?

source: tonight,
es_419: Esta noche,

source: hn{j}hahaha
es_419: Ja, ja, ja

source: r-run away!
es_419: ¡C-corre!

source: poke
es_419: PIC

source: wait, she really used that much?
es_419: Espera, ¿en serio gastó tanto?

source: I am...
es_419: Soy…

source: durability 1/5
es_419: Durabilidad 1/5

source: after that, I’m out! you don’t make a pro like me wait like this!
es_419: ¡Después de eso, me iré! ¡No se hace esperar así a una pro como yo!

source: that b*tch is smart, I’ll give her that.
es_419: Esa p*rra es lista, lo reconozco.

source: activate skill.
es_419: Activar habilidad.

source: on this day...
es_419: Ese día…

source: all 12 kingdoms across the three continents have received notice of this bounty!
es_419: ¡Los 12 reinos de los tres continentes han recibido la noticia de esta recompensa!

source: hmm.
es_419: Mmm.

source: what’s wrong?
es_419: ¿Qué pasa?

source: I was thinking of getting you a gift. do you need anything?
es_419: Y pensé en comprarle algo. ¿Qué necesita?

source: y-yes, ma’am!
es_419: ¡S-sí, ama!

source: swing up.
es_419: Golpe hacia arriba.

source: how about we get some real practice in while our "pro" is gone?
es_419: ¿Qué les parece si practicamos en serio mientras la “chica pro” no está?

source: ...sarang’s own parents.
es_419: … sus padres.

source: the three strongest bosses of urus’ legion.
es_419: Los tres jefes más difíciles de la legión de Urus.

source: kill him.
es_419: Mátenlo.

source: the court filed a restraining order to ensure that sarang’s parents couldn’t get near her.
es_419: El tribunal emitió una orden de restricción para que sus padres no pudieran acercarse a ella.

source: don’t be surprised.
es_419: No te sorprendas.

source: so the players’ data wasn’t deleted. it was just moved into urakan’s horns!
es_419: Así que los datos de los jugadores no se borraron. ¡Solo pasaron a los cuernos de Urakan!

source: that record was the amount of players hitting game over in one single moment.
es_419: El récord de cantidad de jugadores que perdieron en un mismo momento.

source: after killing you, I advanced job classes...
es_419: Después de matarte, avancé de clase…

source: now stop coming after captain luv. you’re just making things harder for me.
es_419: Así que dejen de buscar a la capitana Amor, solo me hacen más difíciles las cosas.

source: might as well kill the strongest boss in the game with it.
es_419: Bien podría matar al jefe más fuerte del juego y listo.

source: m-my remaining ability points is now...
es_419: M-mis puntos de habilidad restantes son…

source: in chrono life, her name is...
es_419: En Chrono Life, su nombre es…

source: hyaaaa!
es_419: ¡JIAAAAA!

source: who the hell are you?
es_419: ¿Quién diablos eres?

source: that’s unbelievable!
es_419: ¡Es increíble!

source: what is this feeling?
es_419: ¿Qué es esta sensación?

source: I cannot fulfill your request.
es_419: … no puedo cumplir tu petición.

source: I already have two ways...
es_419: Ya tengo dos formas…

source: ...money.
es_419: … hacer dinero.

source: this stolen soul will now return to its owner.
es_419: Esta alma robada ahora regresará a su dueño.

source: why on earth would I want to farm with you?
es_419: ¿Por qué rayos querría hacer un grupo contigo?

source: ...it’s all up to them.
es_419: … será cosa de ellos.

source: I’m surprised he has the balls to go live.{j}co
es_419: Me sorprende que tenga agallas para salir en vivo.

source: I’ve never seen a ramborghini!
es_419: ¡Nunca había visto un Ramborghini!
